Sway-Light/sway-light-ht32f52352/main.c
	BFTM0_Configuration();
	
	ledInit();
	wsInit();
	wsBlinkAll(10);
	
	GPTM1_Configuration();
	TM_Configuration();
	I2C_Configuration();
	ADC_Configuration();
	
	initFlag = TRUE;
	ADC_Cmd(HT_ADC0, ENABLE);
	TM_Cmd(HT_GPTM0, ENABLE);
	TM_Cmd(HT_GPTM1, ENABLE);
	
	/* Analog Signal Setup */
	analogSwitcherSetup();
	asSetEnable(TRUE);
	asSetSignal(1);
	
	speakerEnable(TRUE);
	
	espUART_Configuration();
	
	/* MP3 UART Setup */
	mp3UART_Configuration();
	mp3ResetModule(mp3CmdQueue, &queueSize);
	mp3SetDevice(mp3CmdQueue, &queueSize, 1); // SD Card
	delay(100000);
	mp3SetVolume(mp3CmdQueue, &queueSize, 20);
	mp3Play(mp3CmdQueue, &queueSize, 1);
	delay(100000);
	
	asSetSignal(0);
	
	while (1) {
		if (interval_flag == TRUE && on_off_interval != 0) {
			on_off_interval -= 1;
			if (on_off_interval <= 0) printf("\r\nTime up!\r\n");
			else printf("\r%3u secs left", on_off_interval);
			interval_flag = FALSE;
		}
		if (realTime_flag == TRUE && Timestamp != 0) {
			char buf[80];
			Timestamp += 1;
			
			ts = *localtime(&Timestamp);
			strftime(buf, sizeof(buf), "%a %Y-%m-%d %H:%M:%S %Z", &ts);
			printf("\r%s", buf);
			
			realTime_flag = FALSE;
		}
		if (espFlag) {
			u8 i;
			u16 sum = 0, checksum = 0;
			u32 interval = 0, time = 0;
			
			for (i = 1; i < 7; i++) sum += data_from_esp[i];
			checksum = (data_from_esp[7] << 8) + data_from_esp[8];

			printf("\r\n");
			if (!(data_from_esp[0] == 0x95)) {
				printf("start byte Error\r\n");
				errorFlag = TRUE;
			}
			if (checksum == sum) {
				
				if (data_from_esp[1] == 0x01) {
					printf("Switching Mode: \r\n");
					
					for (i = 0; i <= 3; i++)  interval += (data_from_esp[6 - i] << (8 * i));
					if (interval != 0 && on_off_interval == 0) on_off_interval = interval;
					if (interval == 0) mode = data_from_esp[2];
					
					if (mode == 0) {
						
						asSetSignal(1);
						mp3SetVolume(mp3CmdQueue, &queueSize, 20);
						mp3Play(mp3CmdQueue, &queueSize, 2);
						delay(10000);
						asSetSignal(0);
						
						wsClearAll();
						wsShow();
						speakerEnable(FALSE);
						
						printf("Turn off\r\n");
					} else if (mode == 1) {
						
						mode = 3;
						adcIndex = 0;
						
						speakerEnable(TRUE);
						asSetSignal(1);
						mp3SetVolume(mp3CmdQueue, &queueSize, 20);
						mp3Play(mp3CmdQueue, &queueSize, 1);
						delay(10000);
						asSetSignal(0);
						
						printf("Turn on\r\n");
					} else if (mode == 2 || mode == 3) {
						
						if (mode == 2) adcIndex = 0;
						wsUpdateMag();
						
						if (mode == 2) printf("Switch to Lighting Mode\r\n");
						else printf("Switch to Music Mode\r\n");
					}
					
					printf("Interval: %u secs\r\n", on_off_interval);
				} else if (data_from_esp[1] == 0x02) {
					printf("Lighting Mode: \r\n");
					
					L_Type = data_from_esp[2];
					if (L_Type == 0x01) {
						Brightness = data_from_esp[3];
						slideValue = Brightness;
						
						for (i = 0; i < 3; i++) Color[i] = data_from_esp[i + 4];
						
					} else if (L_Type == 0x02) {
						
					} else if (L_Type == 0x03) {
						zoomValue = data_from_esp[3];
					}
					wsUpdateMag();
				} else if (data_from_esp[1] == 0x03) {
					printf("Music Mode: \r\n");
					
					M_Type = data_from_esp[2];
					mLevel = data_from_esp[3];
					if (M_Type == 0x01) {
						for (i = 0; i < 3; i++) {
							if (mLevel == 0x01) high_color[i] = data_from_esp[i + 4];
							else if (mLevel == 0x02) mid_color[i] = data_from_esp[i + 4];
							else if (mLevel == 0x03) low_color[i] = data_from_esp[i + 4];
						}
						
						generateMusicColor();
					} else if (M_Type == 0x02) {
						
					} else if (M_Type == 0x04) {
						
					}
				} else if (data_from_esp[1] == 0x04) {
					printf("Setting: \r\n");
					sync = data_from_esp[2];
					
					if (sync == 0xFF) {
						for (i = 0; i <= 3; i++) time += (data_from_esp[6 - i] << (8 * i));
						Timestamp = time;
					}
					printf("Timestamp: %d sec\r\n", Timestamp);
				}
				
				for (i = 0; i < 9; i++) {
					printf("0x%02X ", data_from_esp[i]);
				}
				printf("checksum Correct!\r\n");
				
			} else {
				printf("checksum Error!\r\n");
//				printf("checksum = %04X\r\n", checksum);
//				printf("sum = %04X\r\n", sum);
				
			}
			espFlag = FALSE;
		}
		if (mBtAction == btClick) {
			static bool flag = TRUE;
			mBtAction = btNone;
			printf("click\r\n");
			
			if (mode == 2) mode = 3;
			else if (mode == 3) {
				mode = 2;
				adcIndex = 0;
			}
			
			wsUpdateMag();
		} else if (mBtAction == btLongClick) {
			mBtAction = btNone;
			printf("long click\r\n");
			
			if (mode != 0) {
				
				asSetSignal(1);
				mp3SetVolume(mp3CmdQueue, &queueSize, 20);
				mp3Play(mp3CmdQueue, &queueSize, 2);
				delay(10000000);
				
				mode = 0;
				
				wsClearAll();
				wsShow();
				speakerEnable(FALSE);
				
				printf("off\r\n");
			} else {
				
				mode = 3;
				adcIndex = 0;
				
				speakerEnable(TRUE);
				asSetSignal(1);
				mp3SetVolume(mp3CmdQueue, &queueSize, 20);
				mp3Play(mp3CmdQueue, &queueSize, 1);
				delay(10000000);
				asSetSignal(0);
				
				printf("on\r\n");
			}
		}
		
		if (touchKeyDelayFlag) {
			if (!GPIO_ReadInBit(HT_GPIOC, GPIO_PIN_0)) {
				TK_CHECK = TRUE;
				Touch.Data = Touchkey_ButtonRead();
				get_TKLR();
//				printf("\rStatus = %d, DATA = %04X, slideValue = %3d, zoomValue = %3d", status, Touch.Data, slideValue, zoomValue);
				if (status == slide) Slide(TK_L, TK_R, &slideValue);
				else if (status == zoom) Zoom(TK_L, TK_R, &zoomValue);
				
				wsUpdateMag();
				touchKeyDelayFlag = FALSE;
			} else {
				TK_CHECK = FALSE;
				TK_1SEC = TRUE;
				TK_COUNT = 0;
				status = none;
			}
		}
		
		if (mode == 3) {
			ADC_MainRoutine();
			if (sampleFlag) {
				for (j = 0; j < TEST_LENGTH_SAMPLES; j += 1) fftData[j] = ((float)InputSignal[j]) / 2048.0;
				RUN_FFT();
				wsUpdateMag();
			}
		}
	}
}

/* Setup functions -----------------------------------------------------------------------------------------*/
void NVIC_Configuration(void) {
	/* Set the Vector Table base location at 0x00000000   */
	NVIC_SetVectorTable(NVIC_VECTTABLE_FLASH, 0x0);
}

void CKCU_Configuration(void) {
	#if 1
	CKCU_PeripClockConfig_TypeDef CKCUClock = {{ 0 }};
	CKCUClock.Bit.AFIO = 1;
	CKCU_PeripClockConfig(CKCUClock, ENABLE);
	#endif

	#if (ENABLE_CKOUT == 1)
	CKOUTConfig();
	#endif
}

