Sway-Light/sway-light-ht32f52352/main.c
void wsUpdateMag() {
	u8 i, j;
	
	if (mode == 2) {
		// Light Source Mode
		u8 rows[16] = {0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0};
		for (i = 0; i < WS_FRQ_SIZE; i += 1) {
			if (zoomValue <= 2) {
				if (i >= 7 && i <= 8) rows[i] = 1;
				else rows[i] = 0;
			} else if (zoomValue <= 4) {
				if (i >= 6 && i <= 9) rows[i] = 1;
				else rows[i] = 0;
			} else if (zoomValue <= 6) {
				if (i >= 5 && i <= 10) rows[i] = 1;
				else rows[i] = 0;
			} else if (zoomValue <= 8) {
				if (i >= 4 && i <= 11) rows[i] = 1;
				else rows[i] = 0;
			} else if (zoomValue <= 10) {
				if (i >= 3 && i <= 12) rows[i] = 1;
				else rows[i] = 0;
			} else if (zoomValue <= 12) {
				if (i >= 2 && i <= 13) rows[i] = 1;
				else rows[i] = 0;
			} else if (zoomValue <= 14) {
				if (i >= 1 && i <= 14) rows[i] = 1;
				else rows[i] = 0;
			} else if (zoomValue <= 16) {
				rows[i] = 1;
			}
		}
		for (i = 0; i < WS_FRQ_SIZE; i += 1) {
			for (j = 0; j < WS_LEV_SIZE; j += 1) {
				if (rows[i] == 1) wsSetColor(WS_LED[i][j], Color, ((float)slideValue) / 100.0);
				else wsSetColor(WS_LED[i][j], ws_clean, 0);
			}
		}
	} else if (mode == 3) {
		// Music Mode
		u8 level;
		
		for (i = 0; i < WS_FRQ_SIZE; i += 1) {
			u8 scale = 2;
			if (OutputSignal[i*scale + 1] < 3) level = 1;
			else if(OutputSignal[i*scale + 1] < 5) level = 2;
			else if(OutputSignal[i*scale + 1] < 8) level = 3;
			else if(OutputSignal[i*scale + 1] < 11) level = 4;
			else if(OutputSignal[i*scale + 1] < 14) level = 5;
			else if(OutputSignal[i*scale + 1] < 17) level = 6;
			else if(OutputSignal[i*scale + 1] < 20) level = 7;
			else if(OutputSignal[i*scale + 1] < 23) level = 8;
			else level = 9;
			
			for (j = 0; j < WS_LEV_SIZE; j += 1) {
				//WS_LED[index][level]
//				if (j < level) wsSetColor(WS_LED[i][j], musicColor[j], ((float)slideValue) / 100.0);
				if (j < level) wsSetColor(WS_LED[i][j], musicColor[j], 0.3);
				else wsSetColor(WS_LED[i][j], musicColor[j], 0);
				if(j == wsLevel[i] - 1)
//					wsSetColor(WS_LED[i][j], musicColor[j], ((float)slideValue) / 100.0);
					wsSetColor(WS_LED[i][j], musicColor[j], 0.3);
			}
			
			if(level > wsLevel[i]) {
				wsLevel[i] = level;
				wsLevelTM[i] = 50;
			}
			if(wsLevelTM[i] == 0) {
				if(wsLevel[i] >= level) wsLevel[i]--;
				wsLevelTM[i] = 8;
			}
		}
	}
	
	startShow = TRUE;
}

void ADC_MainRoutine(void) {
	if (gADC_CycleEndOfConversion) {
		if (adcIndex < TEST_LENGTH_SAMPLES) {
			InputSignal[adcIndex] = gADC_Result;
			InputSignal[adcIndex + 1] = 0;
			adcIndex += 2;
		} else {
			sampleFlag = TRUE;
		}
		gADC_CycleEndOfConversion = FALSE;
	}
}

void RUN_FFT(void) {
	/* Process the data through the CFFT/CIFFT module */
	arm_cfft_f32(&arm_cfft_sR_f32_len64, fftData, ifftFlag, doBitReverse);

	/* Process the data through the Complex Magnitude Module for
	calculating the magnitude at each bin */
	arm_cmplx_mag_f32(fftData, OutputSignal, fftSize);
}

void speakerEnable(bool enable) {
	// Music mute pin
	// Enable  -> low
	// Disable -> high
	GPIO_WriteOutBits(HT_GPIOC, GPIO_PIN_15, !enable);
}

void generateMusicColor(void) {
	u8 color_1 = 0, color_2 = 0;
	
	for (color_1 = 0; color_1 < 9; color_1++) {
		for (color_2 = 0; color_2 < 3; color_2++) {
			if (color_1 == 0 || color_1 == 4 || color_1 == 8) {
				if (color_1 == 0) musicColor[color_1][color_2] = low_color[color_2];
				else if (color_1 == 4) musicColor[color_1][color_2] = mid_color[color_2];
				else if (color_1 == 8) musicColor[color_1][color_2] = high_color[color_2];
			} else {
				u8 mid_low = 0, high_mid = 0;
				if (color_1 <= 3) {
					if (mid_color[color_2] > low_color[color_2]) mid_low = (mid_color[color_2] - low_color[color_2]) / 4 * color_1;
					else if (mid_color[color_2] < low_color[color_2]) mid_low = (low_color[color_2] - mid_color[color_2]) / 4 * (3 - color_1);
					else mid_low = low_color[color_2];
					
					musicColor[color_1][color_2] = mid_low;
				} else if (color_1 <= 7) {
					if (high_color[color_2] > mid_color[color_2]) high_mid = (high_color[color_2] - mid_color[color_2]) / 4 * (color_1 - 4);
					else if (high_color[color_2] < mid_color[color_2]) high_mid = (mid_color[color_2] - high_color[color_2]) / 4 * (3 - (color_1 - 4));
					else high_mid = mid_color[color_2];
					
					musicColor[color_1][color_2] = high_mid;
				}
			}
		}
	}
	
//	for (color_1 = 0; color_1 < 9; color_1++) {
//		printf("musicColor[%2d]: ", color_1);
//		for (color_2 = 0; color_2 < 3; color_2++) {
//			printf("%3d ", musicColor[color_1][color_2]);
//		}
//		printf("\r\n");
//	}
}

static bool IsLeapYear(u32 year) {
	if (((year % 4 == 0) && (year % 100 != 0) ) || (year % 400 == 0)) return TRUE;
	else return FALSE;
}

static void delay(u32 count) {
	while (count--) {
		__NOP(); // Prevent delay loop be optimized
	}
}


/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */
